foldedtoad/nRF51_IR_Temperature/fw/app/main.c
/* 
 *  Copyright (c) 2015 Robin Callender. All Rights Reserved.
 */

#include <stdint.h>
#include <string.h>
#include <stdio.h>

#include "config.h"

#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "nrf_gpio.h"
#include "nrf51_bitfields.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_bas.h"
#include "ble_dis.h"
#include "ble_conn_params.h"
#include "app_scheduler.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "app_timer_appsh.h"
#include "ble_error_log.h"
#include "device_manager.h" 
#include "app_gpiote.h"
#include "ble_debug_assert_handler.h"
#include "pstorage.h"

#include "boards.h"
#include "pstorage_platform.h"
#include "ble_temp.h"
#include "tmp006.h"
#include "dbglog.h"
#include "uart.h"

/* Security options */
static ble_gap_sec_params_t  m_sec_params;                  /* Security requirements for this application. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;    /* Handle of the current connection. */


/* Temp Service Handle */
ble_temp_t                       g_temp_service;

uint8_t                          g_tx_buffer_count_max;

static app_timer_id_t            m_advertising_timer_id;    /* Timer for toggling awaiting-pairing LED */

static dm_application_instance_t m_app_handle;              /* Application identifier allocated by device manager. */

static bool  m_memory_access_in_progress = false;           /* Flag to keep track of ongoing operations on persistent memory. */

/* Battery Service related  */
static ble_bas_t                 m_bas;                    /* Structure used to identify the battery service. */
static app_timer_id_t            m_battery_timer_id;       /* Battery timer. */

#ifdef USE_BATTERY_SIMULATOR 
/* Battery Simulator  */
static ble_sensorsim_cfg_t       m_battery_sim_cfg;        /* Battery Level sensor simulator configuration. */
static ble_sensorsim_state_t     m_battery_sim_state;      /* Battery Level sensor simulator state. */
#endif

#define LFCLKSRC_OPTION     NRF_CLOCK_LFCLKSRC_XTAL_20_PPM
#define HARDWARE_REV_NAME   "1.0"

/*
 *  Function for error handling, which is called when an error has occurred.
 *
 *  warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of error.
 *
 *  param[in] error_code  Error code supplied to the handler.
 *  param[in] line_num    Line number where the handler is called.
 *  param[in] p_file_name Pointer to the file name.
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
#if defined(DEBUG)
    PRINTF("app_error_handler: 0x%x, %d, %s", (unsigned)error_code, (int)line_num, (char*)p_file_name);

    __disable_irq();
    __BKPT(0);
    while (1) { /* spin */}

#else
    // On assert, the system can only recover with a reset.   
    NVIC_SystemReset();
#endif
}


/*
 *  Callback function for asserts in the SoftDevice.
 *
 *  details This function will be called in case of an assert in the SoftDevice.
 *
 *  warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 *  warning On assert from the SoftDevice, the system can only recover on reset.
 *
 *  param[in]   line_num   Line number of the failing ASSERT call.
 *  param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/*
 *  Function for performing battery measurement and updating the 
 *  Battery Level characteristic in Battery Service.
 */
static void battery_level_update(void)
{
    uint32_t err_code;
    uint8_t  battery_level;

#ifdef USE_BATTERY_SIMULATOR

    battery_level = (uint8_t)ble_sensorsim_measure(&m_battery_sim_state, &m_battery_sim_cfg);

#else

    uint16_t    batt_lvl_in_milli_volts;

    batt_lvl_in_milli_volts = 3000;    // FIXME with real ADC measured voltage

    battery_level = battery_level_in_percent(batt_lvl_in_milli_volts);

#endif

    err_code = ble_bas_battery_level_update(&m_bas, battery_level);

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_BUFFERS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
    )
    {
        APP_ERROR_HANDLER(err_code);
    }
}

/*
 *  Function for handling the Battery measurement timer timeout.
 *
 *  This function will be called each time the battery level measurement timer
 *  expires.
 *
 *  param[in]   p_context   Pointer used for passing some arbitrary information 
 *                          (context) from the app_start_timer() call to the 
 *                          timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    battery_level_update();
}

/*
 *  Function for receiving Battery Service events.
 */
void ble_bas_evt_handler(ble_bas_t * p_bas, ble_bas_evt_t * p_evt)
{
    uint32_t err_code;

    switch (p_evt->evt_type) {

        case BLE_BAS_EVT_NOTIFICATION_ENABLED:
            //puts("battatery notification enabled");
            err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_BAS_EVT_NOTIFICATION_DISABLED:
            //puts("battery notification disabled");
            err_code = app_timer_stop(m_battery_timer_id);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // don't care about other events.
            break;
    }
}

#ifdef USE_BATTERY_SIMULATOR
/*
 *  Function for initializing the battery simulator.
 */
static void battery_sim_init(void)
{
    m_battery_sim_cfg.min          = MIN_BATTERY_LEVEL;
    m_battery_sim_cfg.max          = MAX_BATTERY_LEVEL;
    m_battery_sim_cfg.incr         = BATTERY_LEVEL_INCREMENT;
    m_battery_sim_cfg.start_at_max = true;

