foldedtoad/nRF51_IR_Temperature/fw/app/main.c
    ble_sensorsim_init(&m_battery_sim_state, &m_battery_sim_cfg);
}
#endif
  
/*
 *  Function for initializing the Battery Service.
 */
static void battery_service_init(void)
{
    uint32_t       err_code;
    ble_bas_init_t bas_init;
 
#ifdef USE_BATTERY_SIMULATOR
    {
        m_battery_sim_cfg.min          = MIN_BATTERY_LEVEL;
        m_battery_sim_cfg.max          = MAX_BATTERY_LEVEL;
        m_battery_sim_cfg.incr         = BATTERY_LEVEL_INCREMENT;
        m_battery_sim_cfg.start_at_max = true;

        ble_sensorsim_init(&m_battery_sim_state, &m_battery_sim_cfg);
    }
#endif

    // Initialize Battery Service
    memset(&bas_init, 0, sizeof(bas_init));

    // Set security level for the Battery Service.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&bas_init.battery_level_char_attr_md.write_perm);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);

    bas_init.evt_handler          = ble_bas_evt_handler;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);

    puts("Battery Service");
}

/*
 *  Function for initializing the Device Service.
 */
static void device_info_service_init(void)
{
    uint32_t       err_code;
    ble_dis_init_t dis_init;

    // Initialize Device Information Service
    memset(&dis_init, 0, sizeof(dis_init));

    ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, MANUFACTURER_NAME);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init.dis_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init.dis_attr_md.write_perm);

    err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);

    puts("Device Info Service");
}

/*
 *  Function for the LEDs initialization.
 *
 *  details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    nrf_gpio_cfg_output(ADVERTISING_LED_PIN);
    nrf_gpio_cfg_output(CONNECTED_LED_PIN);

    LED_OFF(ADVERTISING_LED_PIN);
    LED_OFF(CONNECTED_LED_PIN);
}

/*
 *  Function for the GAP initialization.
 *
 *  details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    /* Dynamically build-up MAC address and Device Name */
    {
        char device_name [24];
        ble_gap_addr_t mac = { 0 };

        err_code = sd_ble_gap_address_get( &mac );
        APP_ERROR_CHECK(err_code);

        /*  Device name unique-ifier: Use lower 3 bytes of MAC 
         *  as extension to device name. 
         */
        sprintf(device_name, "%s_%02X%02X%02X", DEVICE_NAME,
                mac.addr[2], mac.addr[1], mac.addr[0] );

        PRINTF("device name: %s\n", device_name);

        err_code = sd_ble_gap_device_name_set(&sec_mode,
                                              (const uint8_t *) &device_name,
                                              strlen(device_name));
        APP_ERROR_CHECK(err_code);
    }

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

/*
 *  Function for initializing services that will be used by the application.
 */
static void services_init(void)
{    
    battery_service_init();
    device_info_service_init();

    APP_ERROR_CHECK(ble_temp_init(&g_temp_service));
}


/*
 *  Function for initializing security parameters.
 */
static void sec_params_init(void)
{
    m_sec_params.bond         = SEC_PARAM_BOND;
    m_sec_params.mitm         = SEC_PARAM_MITM;
    m_sec_params.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    m_sec_params.oob          = SEC_PARAM_OOB;
    m_sec_params.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    m_sec_params.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
}


/*
 *  Function for handling the Connection Parameters Module.
 *
 *  details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          note: All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 *  param[in]   p_evt   Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/*
 *  Function for handling a Connection Parameters error.
 *
 *  param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/*
 *  Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

