foldedtoad/nRF51_IR_Temperature/fw/app/main.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/*
 *  Function for initializing the Advertising functionality.
 *
 *  details  Encodes the required advertising data and passes it to the stack.
 *           Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;
    ble_advdata_t scanrsp;
    uint8_t       flags;

    puts("advertising_init");

    /* Set flags according to whether a non-zero advertisement (DISCovery) timeout is given */
    flags = (APP_ADV_TIMEOUT_IN_SECONDS == 0) ?
                  BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE :
                       BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    ble_uuid_t scan_uuids[] = {
        {TEMP_UUID_SERVICE,                   g_temp_service.uuid_type},
        {BLE_UUID_BATTERY_SERVICE,            BLE_UUID_TYPE_BLE},
        {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE},
    };

    /* Build ADVertisement data */
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = flags;

    /* Build SCAN response data */
    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(scan_uuids) / sizeof(scan_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = scan_uuids;

    /* Set ADV and SCAN data */
    err_code = ble_advdata_set(&advdata, &scanrsp);
    APP_ERROR_CHECK(err_code);
}

/*
 *  Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t             err_code;
    ble_gap_adv_params_t adv_params;

    {
        uint32_t    count;

        // Verify if there is any flash access pending, if yes delay starting 
        // advertising until it's complete.
        err_code = pstorage_access_status_get(&count);
        APP_ERROR_CHECK(err_code);

        if (count != 0) {
            m_memory_access_in_progress = true;
            return;
        }
    }

    // Start advertising
    memset(&adv_params, 0, sizeof(adv_params));

    adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
    adv_params.p_peer_addr = NULL;
    adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    adv_params.interval    = APP_ADV_INTERVAL;
    adv_params.timeout     = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = sd_ble_gap_adv_start(&adv_params);
    APP_ERROR_CHECK(err_code);

    // Start advertising LED timer
    err_code = app_timer_start(m_advertising_timer_id,
                               ADVERT_BLINK_INTERVAL_LONG,
                               (void*)ADVERT_BLINK_INTERVAL_LONG);
    APP_ERROR_CHECK(err_code); 
}

/*
 *  Function for handling the advertising timer timeout.
 *  This function will be to toggle the awaiting-pairing LED.
 *
 *  param[in]   p_context   Pointer used for passing some arbitrary information 
 *                          (context) from the app_start_timer() call to the 
 *                          timeout handler.
 */
static void advertising_timeout_handler(void * last_interval)
{
    uint32_t err_code;
    uint32_t next_interval;

    // Derive new time interval, and set LED accordingly.
    switch ((uint32_t) last_interval) {

        case ADVERT_BLINK_INTERVAL_SHORT:
            next_interval = ADVERT_BLINK_INTERVAL_LONG;
            LED_OFF(ADVERTISING_LED_PIN);
            break;

        default:
            PRINTF("Bad time interval: %d\n", (int) last_interval);
            // intentional fall through (try to recover)

        case ADVERT_BLINK_INTERVAL_LONG:
            next_interval = ADVERT_BLINK_INTERVAL_SHORT;
            LED_ON(ADVERTISING_LED_PIN);
            break;
    }

    // Restart advertising timer with new time interval.
    err_code = app_timer_start(m_advertising_timer_id,
                               next_interval, 
                               (void*)next_interval);
    APP_ERROR_CHECK(err_code); 
}

/*
 *  Function for the Timer initialization.
 *
 *  details Initializes the timer module.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);

    err_code = app_timer_create(&m_advertising_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                advertising_timeout_handler);
    APP_ERROR_CHECK(err_code); 

    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);
}

/*
 * 
 */
static uint32_t rounded_div(uint64_t a, uint64_t b)
{
    return ((a + (b/2)) / b);
}

/*
 *  Does APP_TIMER_TICKS() macro as function
 */
uint32_t app_timer_ticks(uint32_t ms)
{
    uint32_t ticks;
    ticks = ((uint32_t) rounded_div((ms) * (uint64_t)APP_TIMER_CLOCK_FREQ,
                                    ((APP_TIMER_PRESCALER) + 1) * 1000));
    return ticks;
}

/*
 *  Function for starting timers.
 */
static void timers_start(void)
{
    // Nothing to do at this time.   
}

/*
 *  Function for handling the Application's BLE Stack events.
 *
 *  param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t                         err_code;

    static ble_gap_evt_auth_status_t m_auth_status;
    static ble_gap_enc_key_t         m_enc_key;
    static ble_gap_id_key_t          m_id_key;
    static ble_gap_sign_info_t       m_sign_key;
    static ble_gap_sec_keyset_t      m_keys = {.keys_periph = {&m_enc_key, &m_id_key, &m_sign_key}};


    switch (p_ble_evt->header.evt_id) {

        case BLE_GAP_EVT_CONNECTED:

            puts("on_ble_evt: CONNECTED");

            // Stop advertising timer
            APP_ERROR_CHECK(app_timer_stop(m_advertising_timer_id));

#if defined(INDICATE_CONNECT)
            LED_ON(CONNECTED_LED_PIN);
#endif
            LED_OFF(ADVERTISING_LED_PIN);

