foldedtoad/nRF51_IR_Temperature/fw/app/main.c
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            break;

        case BLE_GAP_EVT_DISCONNECTED:

            puts("on_ble_evt: DISCONNECTED");

#if defined(INDICATE_CONNECT)
            LED_OFF(CONNECTED_LED_PIN);
#endif
            m_conn_handle = BLE_CONN_HANDLE_INVALID;

            advertising_start();
            break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle,
                                                   BLE_GAP_SEC_STATUS_SUCCESS,
                                                   &m_sec_params,
                                                   &m_keys);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            {
                uint32_t flags = BLE_GATTS_SYS_ATTR_FLAG_SYS_SRVCS | 
                                 BLE_GATTS_SYS_ATTR_FLAG_USR_SRVCS;

                err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, flags);
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BLE_GAP_EVT_AUTH_STATUS:
            m_auth_status = p_ble_evt->evt.gap_evt.params.auth_status;
            break;

        case BLE_GAP_EVT_SEC_INFO_REQUEST:
          {  
            bool                    master_id_matches;
            ble_gap_sec_kdist_t *   p_distributed_keys;
            ble_gap_enc_info_t *    p_enc_info;
            ble_gap_irk_t *         p_id_info;
            ble_gap_sign_info_t *   p_sign_info;

            master_id_matches  = memcmp(&p_ble_evt->evt.gap_evt.params.sec_info_request.master_id,
                                        &m_enc_key.master_id,
                                        sizeof(ble_gap_master_id_t)) == 0;

            p_distributed_keys = &m_auth_status.kdist_periph;

            p_enc_info  = (p_distributed_keys->enc  && master_id_matches) ? &m_enc_key.enc_info : NULL;
            p_id_info   = (p_distributed_keys->id   && master_id_matches) ? &m_id_key.id_info   : NULL;
            p_sign_info = (p_distributed_keys->sign && master_id_matches) ? &m_sign_key         : NULL;

            err_code = sd_ble_gap_sec_info_reply(m_conn_handle, p_enc_info, p_id_info, p_sign_info);
            APP_ERROR_CHECK(err_code);
            break;
          }

        case BLE_GAP_EVT_TIMEOUT:
            if (p_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_ADVERTISING) {
                
                LED_OFF(ADVERTISING_LED_PIN);
                
                // Go to system-off mode (this function will not return; wakeup will cause a reset)  
                puts("system power off");
                err_code = sd_power_system_off();
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BLE_EVT_TX_COMPLETE:
            break;

        default:
            // No implementation needed.
            break;
    }
}

/*
 *  Function for handling the Application's system events.
 */
static void on_sys_evt(uint32_t sys_evt)
{
    switch (sys_evt) {

        case NRF_EVT_FLASH_OPERATION_SUCCESS:
        case NRF_EVT_FLASH_OPERATION_ERROR:
            if (m_memory_access_in_progress) {
                m_memory_access_in_progress = false;
                advertising_start();
            }
            break;

        default:
            // No implementation needed.
            break;
    }
}

/*
 *  Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 *  details This function is called from the scheduler in the main loop after a BLE stack
 *          event has been received.
 *
 *  param[in]   p_ble_evt   Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    ble_conn_params_on_ble_evt(p_ble_evt);
    ble_temp_on_ble_evt(&g_temp_service, p_ble_evt);
    ble_bas_on_ble_evt(&m_bas, p_ble_evt);
    dm_ble_evt_handler(p_ble_evt);
    on_ble_evt(p_ble_evt);
}

/*
 *  Function for dispatching a system event to interested modules.
 *
 *  details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 *  param[in]   sys_evt   System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    pstorage_sys_event_handler(sys_evt);
    on_sys_evt(sys_evt);
}


/*
 *  Function for initializing the BLE stack.
 *
 *  details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;
    static ble_gap_addr_t addr;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, false);

    // Enable BLE stack 
    ble_enable_params_t ble_enable_params;
    memset(&ble_enable_params, 0, sizeof(ble_enable_params));

    ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
    err_code = sd_ble_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    sd_ble_gap_address_get(&addr);
    sd_ble_gap_address_set(BLE_GAP_ADDR_CYCLE_MODE_NONE, &addr);

    // Subscribe for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Get TX buffer count.
    err_code = sd_ble_tx_buffer_count_get(&g_tx_buffer_count_max);
    APP_ERROR_CHECK(err_code);
}


/*
 *  Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

/*
 *  Function for initializing the GPIOTE handler module.
 */
static void gpiote_init(void)
{
    APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);
}

/*
 *  Function for handling the Device Manager events.
 *  param[in]   p_evt   Data associated to the device manager event.
 */
static uint32_t device_manager_evt_handler(dm_handle_t const * p_handle,
                                           dm_event_t const  * p_event,
                                           uint32_t            event_result)
{
    APP_ERROR_CHECK(event_result);

    switch (p_event->event_id) {

        case DM_EVT_LINK_SECURED:
            puts("LINK SECURED event");
            break;

        default:
            // No implementation needed.
            break;
    }

    return NRF_SUCCESS;
}

