foldedtoad/nRF51_IR_Temperature/fw/app/main.c
/*
 *  Function for the Device Manager initialization.
 */
static void device_manager_init(void)
{
    uint32_t                err_code;
    dm_init_param_t         init_data;
    dm_application_param_t  register_param;

    memset(&init_data, 0, sizeof(init_data));

#if 0
    // Clear all bonded centrals if the Bonds Delete button is pushed.
    init_data.clear_persistent_data = (nrf_gpio_pin_read(TEMP_PAIR_BUTTON_PIN) == 0);
#endif

    err_code = dm_init(&init_data);
    APP_ERROR_CHECK(err_code);

    memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));
    
    register_param.sec_param.bond         = SEC_PARAM_BOND;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;

    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}

/*
 *  Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/*
 *  Function for application main entry.
 */
int main(void)
{
    ble_stack_init();
    scheduler_init();

    // Initialize
    uart_init();

    PRINTF("\n*** Temp built: %s %s ***\n\n", __DATE__, __TIME__);

    APP_ERROR_CHECK(pstorage_init());

    leds_init();
    timers_init();
    gpiote_init();
    tmp006_init();

    PUTS("Starting BLE services");

    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
    sec_params_init();

    device_manager_init();

    // Start execution
    timers_start();
    advertising_start();

    // Enter main loop
    for (;;) {
        app_sched_execute();
        power_manage();
    }
}
